Repository: leeliangliang/ClaudeForXcodeProxy
Catalog: ClaudeForXcodeProxy/Localizable.xcstrings
Source language: zh_hans
Languages: en

# alert.ok
source: 确定
en: OK

# alert.title
source: 操作结果
en: Result

# app.subtitle
source: 配置 Xcode ANTHROPIC SDK 代理环境变量
en: Configure Xcode ANTHROPIC SDK Proxy Environment

# app.title
source: Xcode Claude SDK 代理助手
en: Xcode Claude SDK Proxy Helper

# button.apply
source: 应用设置
en: Apply Settings

# button.remove
source: 删除配置
en: Remove Configuration

# error.authToken.empty
source: 请输入 Auth Token
en: Please enter Auth Token

# error.baseURL.empty
source: 请输入 Base URL
en: Please enter Base URL

# error.launchctl.failed
source: launchctl 执行失败
en: launchctl execution failed

# error.setenv.failed %@ %@
source: 设置 %@ 失败: %@
en: Failed to set %@: %@

# form.authToken.placeholder
source: 请输入 Auth Token
en: Enter Auth Token

# form.baseURL.placeholder
source: 请输入 Base URL
en: Enter Base URL

# form.section.config
source: 配置信息
en: Configuration

# result.auto.set
source: 每次登录后会自动设置环境变量
en: Environment variables will be set automatically on login

# result.deleted %@
source: 已删除 %@
en: Deleted %@

# result.env.set
source: 环境变量已设置
en: Environment variables set

# result.no.config
source: 没有找到配置
en: No configuration found

# result.persisted %@
source: 持久化配置: %@
en: Persisted config: %@

# result.restart.xcode
source: 需要重启 Xcode 才能生效
en: Restart Xcode to take effect

# status.configured
source: 配置已生效
en: Configuration Active
